       IDENTIFICATION DIVISION.
       PROGRAM-ID. BUILDNAME.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NOMBRE      PIC X(10).
       01 WS-APELLIDO    PIC X(10).
       01 WS-FULL-NAME   PIC X(15).
       PROCEDURE DIVISION.
           STRING WS-NOMBRE DELIMITED SPACE
                  WS-APELLIDO DELIMITED SPACE
                  INTO WS-FULL-NAME.
           STOP RUN.
