       IDENTIFICATION DIVISION.
       PROGRAM-ID. NUMREDEF.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AMOUNT      PIC 9(5).
       01 WS-AMOUNT-X    REDEFINES WS-AMOUNT PIC 9(8).
       PROCEDURE DIVISION.
           STOP RUN.
