       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMESIZE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-BASE        PIC 9(8).
       01 WS-REDEF       REDEFINES WS-BASE PIC X(8).
       PROCEDURE DIVISION.
           STOP RUN.
