      >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. POC-DIFF-B.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-BALANCE PIC 9(10) VALUE ZEROS.
PROCEDURE DIVISION.
    MOVE 1000 TO WS-BALANCE.
    MOVE 999999 TO WS-BALANCE.
    DISPLAY WS-BALANCE.
    STOP RUN.
