       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAFEMOVE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-TOTAL       PIC 9(8).
       PROCEDURE DIVISION.
           MOVE ZEROS TO WS-TOTAL.
           STOP RUN.
